### <p style="text-align: center;"> **Name:** Shahzaib Khan &ensp;&ensp;&ensp;&ensp;&ensp;&ensp; **Roll No:** 19K-0273 &ensp;&ensp;&ensp;&ensp;&ensp;&ensp; **Section:** BCS-8B</p>

In [1]:
# import warnings
# warnings.simplefilter(action='ignore', category = FutureWarning)

import pandas as pd
# import numpy as np

### **Question: 1**
**_Link not working_**

### **Question: 2**

In [2]:
data = {'cities' : ['lahore','karachi',], 'provinces' : ['punjab','sindh']}

# store data as DataFrame object. Assign object name as frame1
frame1 = pd.DataFrame(data)

# print frame1
frame1

    cities provinces
0   lahore    punjab
1  karachi     sindh

In [3]:
data2 = {"cities": ["islamabad","karachi","peshawar","quetta"],
         "provinces": ["capital","sindh", "KPK","Balochistan"]}

# store data as DataFrame object. Assign object name as frame2
frame2 = pd.DataFrame(data2)

# print frame2
frame2

      cities    provinces
0  islamabad      capital
1    karachi        sindh
2   peshawar          KPK
3     quetta  Balochistan

##### **Task:** combine both objects frame1 and frame2, without any duplicate rows and re-arrange all indexes

In [4]:
frame3 = pd.concat([frame1, frame2]) # combine frame1 and frame2

frame3 # print frame3

      cities    provinces
0     lahore       punjab
1    karachi        sindh
0  islamabad      capital
1    karachi        sindh
2   peshawar          KPK
3     quetta  Balochistan

In [5]:
frame3 = frame3.sort_values('provinces') # sort based on provinces

frame3 # print updated frame3

      cities    provinces
3     quetta  Balochistan
2   peshawar          KPK
0  islamabad      capital
0     lahore       punjab
1    karachi        sindh
1    karachi        sindh

In [6]:
frame3 = frame3.drop_duplicates('provinces') # remove duplicates rows

frame3 # print updated frame3

      cities    provinces
3     quetta  Balochistan
2   peshawar          KPK
0  islamabad      capital
0     lahore       punjab
1    karachi        sindh

In [7]:
frame3 = frame3.reset_index(drop = True) # re-arrange all indexes

frame3 # print finalized frame3

      cities    provinces
0     quetta  Balochistan
1   peshawar          KPK
2  islamabad      capital
3     lahore       punjab
4    karachi        sindh

### **Question: 3**

In [8]:
df = pd.DataFrame({'Name':['','Ali','Ahmed','Nida',''],
                   'Field':['C','E','E','C','C'],
                   'Age':['','','','',''],
                   'Marks':[-90,60,-10,70,75]})

df # print dataframe

    Name Field Age  Marks
0            C        -90
1    Ali     E         60
2  Ahmed     E        -10
3   Nida     C         70
4            C         75

##### **Part i)** Drop column Age as it does not contain any value

In [9]:
df.drop('Age', axis = 1, inplace = True)

df

    Name Field  Marks
0            C    -90
1    Ali     E     60
2  Ahmed     E    -10
3   Nida     C     70
4            C     75

##### **Part ii)** All empty strings in Name column should be replaced by “---“

In [10]:
# df['Name'] = df['Name'].replace(to_replace = '', value = '---') # verbose/scalar method
# df['Name'] = df['Name'].map(lambda x: '---' if x == '' else x) # vebose/map method

df = df.replace({'Name': {'': '---'}}) # short/dictionary-like method

df

    Name Field  Marks
0    ---     C    -90
1    Ali     E     60
2  Ahmed     E    -10
3   Nida     C     70
4    ---     C     75

##### **Part iii)** In 'Field' replace 'C' with 0 & 'E' with 1. After this operation, colomn must contain only numeric values.

In [11]:
# df['Field'] = df['Field'].replace(['C', 'E'], [0, 1]) # verbose/list-like method [deprecated]
# df = df.replace({'Field' : {'C':0, 'E':1}}) # short/dictionary-like method [deprecated]

df['Field'] = df['Field'].map({'C':0, 'E':1}) # map method [standard, for replacing multiple different values]

df

    Name  Field  Marks
0    ---      0    -90
1    Ali      1     60
2  Ahmed      1    -10
3   Nida      0     70
4    ---      0     75

##### **Part iv)** -ve values in 'Marks' should be replaced with avg of all valid values in same column

In [12]:
# df['Marks'][df['Marks'] < 0] = int(df['Marks'][df['Marks'] >= 0].mean()) # old/deprecated method
# df['Marks'] = np.where(df['Marks'] < 0, int(df['Marks'][df['Marks'] >= 0].mean()), df['Marks']) # less efficient method

df.loc[df['Marks'] < 0, 'Marks'] = int(df['Marks'][df['Marks'] >= 0].mean())

df # print final dataframe

    Name  Field  Marks
0    ---      0     68
1    Ali      1     60
2  Ahmed      1     68
3   Nida      0     70
4    ---      0     75

### **Question: 4**
**_tasks in both links done seperately in different notebooks_**